//#Использовать "../src"

//#Использовать asserts

Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ЗапаковкуДанныеВКласс");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ЗапаковкуДанныеВКласс() Экспорт
	
	ПодключитьСценарий("./src/Классы/ЗаписьBinData.os", "ЗаписьBinData");

	Запись = Новый ЗаписьBinData("test", "./src/Классы");
	//ТестовыйФайл = Новый Файл(".")

	Запись.ДобавитьФайл("./tests/fixtures/test.txt");

	Запись.ЗаписатьКласс();

КонецПроцедуры

ТестДолжен_ЗапаковкуДанныеВКласс();

